[
  {
    "id": 1,
    "image": "https://img.icons8.com/?size=1200&id=tqP4CSFqqdNr&format=png",
    "title": "Sky Explorer",
    "companyName": "SkyTech Studios",
    "description": "Embark on a breathtaking journey through the skies with Sky Explorer, the ultimate immersive flight simulator. Experience stunning, high-definition graphics that bring realistic landscapes and dynamic weather to life. Choose from a vast fleet of meticulously detailed aircraft, from nimble single-engine planes to massive commercial airliners. Whether you're a seasoned pilot or a beginner, the intuitive controls and comprehensive tutorials will have you soaring through the clouds in no time. Explore diverse regions, complete challenging missions, and master the art of flying in this exhilarating adventure.",
    "size": 150,
    "reviews": "120K",
    "ratingAvg": 4.7,
    "downloads": "5M",
    "ratings": [
      { "name": "1 star", "count": 1200 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 5000 },
      { "name": "4 star", "count": 35000 },
      { "name": "5 star", "count": 80000 }
    ]
  },
  {
    "id": 2,
    "image": "https://img.icons8.com/?size=96&id=DjxLmZ1Zqncw&format=png",
    "title": "FitTrack Pro",
    "companyName": "Healthify Inc.",
    "description": "FitTrack Pro is your essential personal fitness companion. This comprehensive app helps you track every aspect of your wellness journey, from workouts and meals to your overall progress. Log your exercises with precision, monitor your calorie intake with a simple food diary, and set personalized fitness goals. The app offers a wide range of workout plans, tailored to different fitness levels and objectives. Get motivational insights, track your achievements, and stay on course to a healthier you with FitTrack Pro.",
    "size": 120,
    "reviews": "95K",
    "ratingAvg": 4.5,
    "downloads": "10M",
    "ratings": [
      { "name": "1 star", "count": 1000 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 4000 },
      { "name": "4 star", "count": 30000 },
      { "name": "5 star", "count": 64000 }
    ]
  },
  {
    "id": 3,
    "image": "https://img.icons8.com/?size=96&id=Xwqu8cUREfko&format=png",
    "title": "Pixel Painter",
    "companyName": "Artistic Minds",
    "description": "Unleash your creativity with Pixel Painter, a powerful and user-friendly drawing app. Designed for artists of all skill levels, this app provides an extensive collection of brushes, from realistic watercolors to sharp digital pencils. The intuitive interface makes it easy to create stunning digital art, with layers, color palettes, and a full suite of editing tools at your fingertips. Whether you're sketching a quick idea or crafting a detailed masterpiece, Pixel Painter provides the perfect canvas for your imagination.",
    "size": 80,
    "reviews": "85K",
    "ratingAvg": 4.8,
    "downloads": "2M",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 25000 },
      { "name": "5 star", "count": 60000 }
    ]
  },
  {
    "id": 4,
    "image": "https://img.icons8.com/?size=96&id=11848&format=png",
    "title": "TaskMaster",
    "companyName": "Productivity Plus",
    "description": "Boost your productivity and reclaim your time with TaskMaster. This intuitive app helps you effortlessly organize your life by managing tasks, projects, and deadlines. Create to-do lists, set reminders, and prioritize your work with a clean, easy-to-use interface. The app allows you to categorize tasks by project, due date, or priority, ensuring nothing falls through the cracks. Collaborate with others, track your progress, and feel the satisfaction of checking off completed items as you work toward your goals.",
    "size": 60,
    "reviews": "70K",
    "ratingAvg": 4.3,
    "downloads": "3M",
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 4000 },
      { "name": "4 star", "count": 25000 },
      { "name": "5 star", "count": 38000 }
    ]
  },
  {
    "id": 5,
    "image": "https://img.icons8.com/?size=96&id=20859&format=png",
    "title": "PhotoSnap",
    "companyName": "SnapTech",
    "description": "Transform your photos into works of art with PhotoSnap. This advanced photo-editing app offers a wide array of filters, effects, and tools to enhance your images. With professional-grade features and an easy-to-navigate interface, you can adjust brightness, contrast, and saturation with a simple tap. Apply artistic filters, add text and stickers, or use sophisticated editing tools like selective color and blur. Share your creations instantly on social media and impress your friends with stunning visuals.",
    "size": 90,
    "reviews": "95K",
    "ratingAvg": 4.6,
    "downloads": "7M",
    "ratings": [
      { "name": "1 star", "count": 1000 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 3000 },
      { "name": "4 star", "count": 35000 },
      { "name": "5 star", "count": 60000 }
    ]
  },
  {
    "id": 6,
    "image": "https://img.icons8.com/?size=160&id=zJJ51w5xgKWA&format=png",
    "title": "WeatherNow",
    "companyName": "ClimateTech",
    "description": "Stay one step ahead with WeatherNow, your source for real-time weather updates and accurate forecasts. The app provides a detailed look at current conditions, including temperature, humidity, wind speed, and precipitation. Get hourly and weekly forecasts to plan your day, whether it's for a morning run or a weekend trip. The intuitive radar map lets you track storms and see whats coming your way. With push notifications for severe weather alerts, you'll always be prepared for whatever the sky brings.",
    "size": 70,
    "reviews": "80K",
    "ratingAvg": 4.4,
    "downloads": "4M",
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 3000 },
      { "name": "4 star", "count": 25000 },
      { "name": "5 star", "count": 42000 }
    ]
  },
  {
    "id": 7,
    "image": "https://img.icons8.com/?size=96&id=tgRqDvvOOuEF&format=png",
    "title": "NewsFlash",
    "companyName": "MediaCorp",
    "description": "NewsFlash keeps you informed with the latest news from around the world. Get real-time updates on breaking news, politics, technology, sports, and more, all curated from reliable sources. The app’s personalized feed learns your interests, delivering the stories that matter most to you. Bookmark articles to read later, share them with friends, and dive into in-depth analysis from top journalists. With NewsFlash, you can stay on top of the world's most important events wherever you are.",
    "size": 110,
    "reviews": "90K",
    "ratingAvg": 4.2,
    "downloads": "6M",
    "ratings": [
      { "name": "1 star", "count": 1200 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 5000 },
      { "name": "4 star", "count": 27000 },
      { "name": "5 star", "count": 55000 }
    ]
  },
  {
    "id": 8,
    "image": "https://img.icons8.com/?size=96&id=68368&format=png",
    "title": "GameZone",
    "companyName": "PlayTech",
    "description": "Dive into a world of endless entertainment with GameZone. This app is a hub for exciting games and challenges, offering a diverse collection of genres from action and adventure to puzzles and strategy. Discover new games tailored to your interests, connect with friends, and compete on global leaderboards. Regular updates introduce fresh content and events, ensuring there’s always something new to play. With stunning graphics and seamless gameplay, GameZone is your ticket to a thrilling gaming experience.",
    "size": 130,
    "reviews": "95K",
    "ratingAvg": 4.9,
    "downloads": "8M",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 200 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 89000 }
    ]
  },
  {
    "id": 9,
    "image": "https://img.icons8.com/?size=96&id=18901&format=png",
    "title": "ShopSmart",
    "companyName": "RetailTech",
    "description": "ShopSmart makes shopping smarter by helping you find the best deals and discounts from your favorite stores. The app aggregates promotions and coupons from thousands of retailers, allowing you to compare prices and save money with ease. Create a personalized shopping list, get alerts for price drops on items you love, and receive exclusive offers. ShopSmart simplifies your shopping experience, putting the best deals right in your pocket.",
    "size": 95,
    "reviews": "88K",
    "ratingAvg": 4.3,
    "downloads": "9M",
    "ratings": [
      { "name": "1 star", "count": 1000 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 4000 },
      { "name": "4 star", "count": 30000 },
      { "name": "5 star", "count": 54000 }
    ]
  },
  {
    "id": 10,
    "image": "https://img.icons8.com/?size=96&id=81TSi6Gqk0tm&format=png",
    "title": "MusicWave",
    "companyName": "SoundTech",
    "description": "Stream your favorite music and discover new artists with MusicWave. With a massive library spanning every genre, this app gives you access to millions of songs, albums, and curated playlists. Create your own playlists, listen to personalized radio stations, or explore new music with our discovery features. Enjoy a seamless listening experience with high-quality audio and offline playback. MusicWave is your ultimate destination for all things music.",
    "size": 80,
    "reviews": "95K",
    "ratingAvg": 4.7,
    "downloads": "10M",
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 3000 },
      { "name": "4 star", "count": 35000 },
      { "name": "5 star", "count": 60000 }
    ]
  },
  {
    "id": 11,
    "image": "https://img.icons8.com/?size=96&id=1xLQxmxqHkqV&format=png",
    "title": "TravelMate",
    "companyName": "JourneyTech",
    "description": "Planning your next adventure is easier than ever with TravelMate. This comprehensive app helps you explore new destinations and organize your trips down to the last detail. Discover hidden gems, book accommodations, and find the best local restaurants and activities. Create detailed itineraries, track your budget, and get real-time flight updates. TravelMate provides all the tools you need to turn your dream vacation into a reality, making every journey smooth and memorable.",
    "size": 100,
    "reviews": "92K",
    "ratingAvg": 4.6,
    "downloads": "6M",
    "ratings": [
      { "name": "1 star", "count": 900 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 3500 },
      { "name": "4 star", "count": 25000 },
      { "name": "5 star", "count": 45000 }
    ]
  },
  {
    "id": 12,
    "image": "https://img.icons8.com/?size=96&id=E1Io1QTAzIaF&format=png",
    "title": "NoteMaster",
    "companyName": "Productivity Plus",
    "description": "Organize your thoughts and ideas effortlessly with NoteMaster. This intuitive note-taking app allows you to capture information quickly, whether it's a quick memo, a detailed project plan, or a shopping list. With features like rich text formatting, checklists, and easy organization, you can keep your notes tidy and accessible. Sync your notes across all your devices, so you can always pick up where you left off. NoteMaster helps you stay on top of everything, making sure no great idea is ever lost.",
    "size": 70,
    "reviews": "85K",
    "ratingAvg": 4.4,
    "downloads": "5M",
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 3000 },
      { "name": "4 star", "count": 25000 },
      { "name": "5 star", "count": 42000 }
    ]
  },
  {
    "id": 13,
    "image": "https://img.icons8.com/?size=128&id=eGc97b6eA0zS&format=png",
    "title": "MindBoost",
    "companyName": "BrainyApps",
    "description": "Give your brain a workout with MindBoost. This app features a collection of fun and engaging puzzles and cognitive exercises designed to sharpen your mind. Challenge your memory, logic, and problem-solving skills with daily brain-training sessions. Track your progress over time and see how your cognitive abilities improve. Whether you're looking to boost your concentration or simply want a mental break, MindBoost offers a rewarding and entertaining way to keep your brain in top shape.",
    "size": 65,
    "reviews": "78K",
    "ratingAvg": 4.5,
    "downloads": "3M",
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 2500 },
      { "name": "4 star", "count": 20000 },
      { "name": "5 star", "count": 50000 }
    ]
  },
  {
    "id": 14,
    "image": "https://img.icons8.com/?size=96&id=122657&format=png",
    "title": "Foodie",
    "companyName": "EatWell Inc.",
    "description": "Calling all food lovers! Foodie is your all-in-one culinary companion. Discover a world of recipes, from quick weeknight meals to gourmet creations. Find the best restaurants in your area, read reviews, and make reservations with ease. The app also provides valuable cooking tips, techniques, and ingredient suggestions to help you become a master chef in your own kitchen. Whether you’re cooking at home or dining out, Foodie is the only app you’ll need.",
    "size": 85,
    "reviews": "80K",
    "ratingAvg": 4.6,
    "downloads": "7M",
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 3000 },
      { "name": "4 star", "count": 30000 },
      { "name": "5 star", "count": 47000 }
    ]
  },
  {
    "id": 15,
    "image": "https://img.icons8.com/?size=96&id=14799&format=png",
    "title": "HealthPlus",
    "companyName": "WellnessCorp",
    "description": "Take control of your well-being with HealthPlus. This app helps you monitor your health stats and get personalized insights to live a healthier life. Track your daily steps, heart rate, sleep patterns, and more. Set wellness goals and receive personalized tips to help you achieve them. HealthPlus also offers guided meditations and workout routines to support both your physical and mental health. With all your health information in one place, you can make informed decisions and stay on track with your wellness journey.",
    "size": 90,
    "reviews": "88K",
    "ratingAvg": 4.7,
    "downloads": "6M",
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 3500 },
      { "name": "4 star", "count": 27000 },
      { "name": "5 star", "count": 56000 }
    ]
  },
  {
    "id": 16,
    "image": "https://img.icons8.com/?size=96&id=vo1XcGH8QAag&format=png",
    "title": "Learnify",
    "companyName": "EduTech",
    "description": "Learnify makes learning new skills fun and interactive. Dive into a wide range of subjects, from coding and languages to history and art, with engaging lessons and quizzes. The app's bite-sized content and gamified learning approach help you master complex topics quickly. Track your progress, earn achievements, and connect with a community of fellow learners. With Learnify, education is no longer a chore—it’s an adventure.",
    "size": 100,
    "reviews": "82K",
    "ratingAvg": 4.5,
    "downloads": "4M",
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 3000 },
      { "name": "4 star", "count": 20000 },
      { "name": "5 star", "count": 54000 }
    ]
  },
  {
    "id": 17,
    "image": "https://img.icons8.com/?size=96&id=13013&format=png",
    "title": "SmartWallet",
    "companyName": "FinTech Solutions",
    "description": "Managing your finances has never been easier than with SmartWallet. This powerful app helps you track your expenses, create budgets, and manage all your payments in one secure place. Get a clear overview of your spending habits with detailed reports and visualizations. Set budget goals for different categories like groceries and entertainment, and receive alerts when you're close to your limit. SmartWallet gives you the clarity and control you need to achieve your financial goals.",
    "size": 95,
    "reviews": "90K",
    "ratingAvg": 4.4,
    "downloads": "5M",
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 4000 },
      { "name": "4 star", "count": 25000 },
      { "name": "5 star", "count": 54000 }
    ]
  },
  {
    "id": 18,
    "image": "https://img.icons8.com/?size=96&id=63242&format=png",
    "title": "FunFlix",
    "companyName": "StreamCorp",
    "description": "Get ready for unlimited entertainment with FunFlix. Stream a vast library of movies, TV shows, and exclusive content anytime, anywhere. Browse through a variety of genres, from action-packed thrillers to heartwarming comedies. Create a watchlist of your favorite shows, get personalized recommendations based on your viewing history, and enjoy a high-quality, ad-free streaming experience. FunFlix is your go-to app for all your binge-watching needs.",
    "size": 130,
    "reviews": "85K",
    "ratingAvg": 4.6,
    "downloads": "7M",
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 3000 },
      { "name": "4 star", "count": 30000 },
      { "name": "5 star", "count": 47000 }
    ]
  },
  {
    "id": 19,
    "image": "https://img.icons8.com/?size=100&id=ebzNEiNA4sQ6&format=png",
    "title": "RideEasy",
    "companyName": "TransitTech",
    "description": "Booking a ride has never been more convenient than with RideEasy. This app connects you with a network of reliable drivers for a quick and safe journey. Simply enter your destination, choose your ride option, and get an upfront fare estimate. Track your driver in real time and share your trip details with loved ones for added security. With various vehicle options and easy payment methods, RideEasy makes transportation effortless.",
    "size": 90,
    "reviews": "78K",
    "ratingAvg": 4.5,
    "downloads": "4M",
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 3000 },
      { "name": "4 star", "count": 20000 },
      { "name": "5 star", "count": 50000 }
    ]
  },
  {
    "id": 20,
    "image": "https://img.icons8.com/?size=96&id=23042&format=png",
    "title": "GardenPlus",
    "companyName": "NatureApps",
    "description": "Cultivate your green thumb with GardenPlus. Whether you’re a beginner or an experienced gardener, this app provides the tips and tools you need to grow a thriving garden. Identify plants with a simple photo, get personalized watering reminders, and track your plants' growth with a digital journal. The app also offers a library of gardening tutorials and a community forum where you can share advice and show off your progress. GardenPlus makes gardening a joy, helping your plants flourish.",
    "size": 85,
    "reviews": "80K",
    "ratingAvg": 4.7,
    "downloads": "5M",
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 3000 },
      { "name": "4 star", "count": 25000 },
      { "name": "5 star", "count": 47000 }
    ]
  }
]
